// Напишіть функцію, яка приймає масив унікальних елементів і генерує всі можливі перестановки цього масиву. 
// Використовуйте рекурсію для знаходження всіх перестановок. Наприклад, якщо вхідний масив [1, 2, 3], 
// функція має повернути масив, що містить [1, 2, 3], [1, 3, 2], [2, 1, 3], [2, 3, 1], [2, 3, 1], [3, 1, 2] і [3, 2, 1].
function getPermutations(arr) {
    if (arr.length <= 1) return [arr];
    
    return arr.flatMap((el, i) => 
        getPermutations([...arr.slice(0, i), ...arr.slice(i + 1)])
        .map(perm => [el, ...perm]) 
    );
}

console.log(getPermutations([2, 3, 4]));